#ifndef _VOD_TRANS_API_H_
#define _VOD_TRANS_API_H_

#include "vod_in_common_def.h"
#include "vod_in_typedef.h"

enum
{
	VOD_TRANS_FRAME_TYPE_AUDIO = 0,
	VOD_TRANS_FRAME_TYPE_VIDEO,

	VOD_TRANS_FRAME_TYPE_END
};

typedef struct ts_stream_info{
	int pmt_pid;
	int aud_pid;
	int vid_pid;
	int pcr_pid;
	int aud_type;
	int vid_type;
}VOD_TRANS_TS_INFO;

/*------------------------------------------------------------------------------
	说明: 初始化里面的对列等数据结构
	type == VOD_TRANS_TYPE_ISMA, 表示是isma方式的播放
	type == VOD_TRANS_TYPE_TS, 表示是ts方式的播放
	如果成功, 返回0, 失败返回1
------------------------------------------------------------------------------*/
int32_t   vod_trans_open (int32_t type);


/*------------------------------------------------------------------------------
	说明: 释放资源
------------------------------------------------------------------------------*/
void  vod_trans_close(void);


/*------------------------------------------------------------------------------
	说明: 分配一个buffer给调用者使用, 这样可减小一次数据拷贝.
	返回0表示分配失败, 非0为buffer地址
	len是调用者传入的参数
	token是返回给调用者的令牌, buffer使用完后要把令牌回传
------------------------------------------------------------------------------*/
uint8_t*   vod_trans_malloc_buffer(int32_t len, uint32_t* token);


/*------------------------------------------------------------------------------
	说明: 与vod_trans_isma_malloc_buffer函数配套使用
	把数据复制到了malloc出的buffer后时, 要调用这个函数通知系统处理这块buffer
	Token是vod_trans_isma_malloc_buffer取得的令牌
	如果调用者无法把数据复制到buffer上(如网络recv失败), 把state设为0, 反之设为1
------------------------------------------------------------------------------*/
int32_t  vod_trans_insert_buffer(uint32_t token, int32_t state);


/*------------------------------------------------------------------------------
	说明: 解码器调用者调用这个函数取出一个完整的pes包. 
	aud_or_vid=0表示取音频, aud_or_vid=1表示取视频
	Buffer是该模块创建的, 供解码器使用
	len是返回buffer长度
	iframe=0表示不是I帧, iframe=1表示是I帧
	5516平台的解码器不支持pes包, 因此解码器要去掉14字节的pes头再解码
	(其实最佳设计应这里出来raw数据就行了, 各平台根据解码器特性加上自已需要的头,
	这部分代码放入驱动去做)
	如果成功, 返回0, 失败返回1
------------------------------------------------------------------------------*/
int32_t   vod_trans_get_frame(int32_t aud_or_vid, uint8_t** buffer, int32_t* len, uint32_t* timestamp, int32_t* iframe);


/*------------------------------------------------------------------------------
	说明: 设置buffer的大小, size表示rtp包个数, 每个rtp包大约1500byte, 默认300个rtp
	包, 为音频和视频加起来的大小
------------------------------------------------------------------------------*/
void  vod_trans_set_bufsize(int32_t size);


/*------------------------------------------------------------------------------
	说明: 清空buffer
------------------------------------------------------------------------------*/
void  vod_trans_clean(void);


/*------------------------------------------------------------------------------
	说明: 获取buffer中的video包个数(isma方式是rtp包, ts方式是ts包)
------------------------------------------------------------------------------*/
uint32_t vod_trans_get_v_packnum(void);


/*------------------------------------------------------------------------------
	说明: 获取buffer中的audio包个数(isma方式是rtp包, ts方式是ts包)
------------------------------------------------------------------------------*/
uint32_t vod_trans_get_a_packnum(void);


#endif
